---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.InstanceId
source: html/abd05aa9-aa4a-3cb2-48fa-f5f0243951f6.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.InstanceId Property

The Revit id of the external data instance being removed from Revit document.

## Syntax (C#)
```csharp
public ElementId InstanceId { get; }
```